stf = {
    (0, 'WhiteSpace'): 0,
    (0, 'Letter'): 1, (1, 'Letter'): 1, (1, 'Digit'): 1, (1, 'OtherChar'): 2,
    (0, 'Digit'): 3, (3, 'Digit'): 3, (3, 'OtherChar'): 4,
    (3, 'Dot'): 5, (5, 'Digit'): 5, (5, 'OtherChar'): 6,
    (3, 'Letter'): 101,
    (5, 'Letter'): 101,
    (0, '>'): 7, (0, '<'): 7, (7, '='): 8,
    (7, 'OtherChar'): 9,
    (0, '='): 10, (10, '='): 11,
    (10, 'OtherChar'): 12,
    (0, '+'): 13, (0, '-'): 13, (0, '*'): 13, (0, '('): 13, (0, ')'): 13,
    (0, '}'): 13, (0, '{'): 13, (0, '^'): 13, (0, ';'): 13,
    (0, 'EndOfLine'): 14,
    (0, '!'): 15, (15, '='): 16,
    (15, 'OtherChar'): 102,
    (0, '/'): 17, (17, '/'): 18, (18, 'OtherChar'): 19,
    (17, 'OtherChar'): 20,
    (0, 'OtherChar'): 100,
}

init_state = 0                                                  # q0 - стартовий стан
F = {2, 4, 6, 8, 9, 11, 12, 13, 14, 16, 19, 20, 100, 101, 102}  # множина заключних станів
F_star = {2, 4, 6}                                              # зірочка
F_error = {100, 101, 102}                                       # обробка помилок
